<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 109.0.1518.49--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">載入器覆寫設定</string><string id="BrowserExecutableFolder">設定瀏覽器可執行檔資料夾的位置</string><string id="BrowserExecutableFolder_Explain">此原則可將 WebView2 應用程式設定為在指定的路徑中使用 WebView2 Runtime。資料夾應該包含下列檔案： msedgewebview2.exe、msedge.dll 等等。

若要設定資料夾路徑的值，請提供 [值名稱] 及 [值對]。將值名稱設定為 [應用程式使用者模型 ID] 或可執行檔名稱。您可以使用 &quot;*&quot; 萬用字元作為值名稱，以套用到所有應用程式。

範例值:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">設定瀏覽器可執行檔資料夾的位置</string><string id="ReleaseChannelPreference">設定發行通道搜尋順序喜好設定</string><string id="ReleaseChannelPreference_Explain">預設通道搜尋順序為 WebView2 Runtime、Beta、Dev 和 Canary。

若要反向預設的搜尋順序，請將此原則設定為 1.

       若要設定發行通道喜好設定的值，請提供 [值名稱] 和 [值對]。將 [值名稱] 設定為 [應用程式使用者模型 ID] 或可執行檔名。您可以使用 &quot;*&quot; 萬用字元作為值名稱，以套用到所有應用程式。

範例值:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">設定發行通道搜尋順序喜好設定</string><string id="ExperimentationAndConfigurationServiceControl">透過 [試驗和設定服務] 控制通訊</string><string id="ExperimentationAndConfigurationServiceControl_Explain">使用試驗和設定服務來部署試驗和設定承載。

     試驗承載是由 Microsoft 為測試和意見反應所啟用的初期開發功能清單所組成。

     設定承載包含 Microsoft 要部署以優化使用者體驗的建議設定清單。例如，設定負載可指定傳送要求到試驗和佈建服務的頻率，以取得最新的負載。

     設定承載可能也會包含基於相容性理由，在特定網域上要採取的動作清單。例如，如果網站已中斷，瀏覽器可能會覆蓋網站上的使用者代理字串。在 Microsoft 嘗試解決網站擁有人的問題時，這些動作都是暫時性的。

     如果您將此原則設定為「FullMode」，系統就會從試驗和設定服務下載完整承載。這包括試驗和設定承載。

     如果您將此原則設定為「ConfigurationsOnlyMode」，則只會下載設定承載。

     如果您將此原則設定為「RestrictedMode」，就會完全停止與試驗和設定服務的通訊。

     如果您未在受管理的裝置上設定此原則，則 Beta 和 Stable 通道上的行為與「ConfigurationsOnlyMode」相同。在 Canary 和 Dev 通道上，行為與 'FullMode' 相同。

如果未在未管理裝置上設定此原則，則行為與「FullMode」相同。

原則選項對應:

* FullMode (2) = 擷取設定與實驗

* ConfigurationsOnlyMode (1) = 僅限擷取設定

* RestrictedMode (0) = 停用與 [試驗和設定服務] 的通訊

設定此原則時，請使用上述資訊。</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">擷取設定與實驗</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">僅限擷取設定</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">停用與 [試驗和設定服務] 的通訊</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge版本 97，Windows 7 或更新版本</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge版本 87，Windows 7 或更新版本</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - 預設設定 (使用者可以覆寫)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">將值名稱設定為應用程式使用者模型識別碼或可執行檔名稱。您可以使用 &quot;*&quot; 萬用字元作為值名稱，以套用到所有應用程式。</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">將值名稱設定為應用程式使用者模型識別碼或可執行檔名稱。您可以使用 &quot;*&quot; 萬用字元作為值名稱，以套用到所有應用程式。</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">透過 [試驗和設定服務] 控制通訊</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>